export const validationMessages = {
    email: "لطفا یک ایمیل صحیح وارد کنید.",
    default: "پر کردن این فیلد الزامی است.",
    min: {
        min3: "حداقل طول این فیلد باید 3 کاراکتر باشد.",
        passMin8: "طول پسورد حداقل باید 8 کاراکتر باشد.",
    },
    max: {
        max100: "حداکثر طول این فیلد میتواند 100 کاراکتر باشد.",
        passMax100: "طول پسورد حداکثر میتواند 100 کاراکتر باشد.",
    },
    password: {
        match: "رمزهای عبور وارد شده با یکدیگر مطابقت ندارند.",
        haveUpper: "در رمز عبور باید حداقل یک حرف بزرگ انگلیسی وجود داشته باشد.",
        haveNum: "در رمز عبور باید حداقل یک عدد وجود داشته باشد.",
    },
};
